title: PowerShell New-Item creating directory in C:\Temp
id: 8a1d2f6a-3c44-4c9a-9eaa-2b4b8f1d0f3c
status: experimental
description: Detects PowerShell creating a new directory in the Temp folder.
references:
  - https://www.elastic.co/security-labs/silentconnect-delivers-screenconnect
author: Huntable CTI Studio User
date: 2026-03-20
tags:
  - attack.t1070
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    process_name: powershell.exe
    process_command_line: '*New-Item -ItemType Directory -Path ''C:\Temp'' -Force*'
  condition: selection
falsepositives:
  - "Administrative scripts or installers that intentionally create C:\\Temp directories"
  - "Automated software update processes that create temporary folders"
  - "Monitoring or provisioning scripts run by administrators"
level: medium
